org/misc/responses/IrateLibertarian/voluntary-prisons.md

# Table of Contents

1.  [My Response](#org74daaff)
2.  [Towards a Theory of Libertarian Prisons](#org5d1e513)



<a id="org74daaff"></a>

# My Response

> In having been found guilty of a crime - either violation of the NAP or breach of a rule set by a covenant (a rule you agreed to) - you are told to submit yourself to a custodial penalty or face physical removal

It is strange wording to say &ldquo;either violation of the NAP or breach of a rule set by a covenant,&rdquo; to explain I will quickly elucidate the title-transfer theory of contracts set forth by Rothbard. The only valid contracts are those that define the transfer of the title to property. Under this definition Kinsella points out<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> that it is not actually logically possible to break a contract. Lets imagine that we are in a green-shirt covenant where the rule is that you must wear green shirts at all times. How could this rule be formed contractually? It would require some manner of penalty clause, perhaps if you are found not wearing a green shirt, you agree to transfer the title to 5 units of gold. The instant you are indeed found sans green shirt, you instantaneously transfer said gold to whomever the contract was with, perhaps John Galt. Therefore no crime has actually occurred insofar as no conflict over that gold exists. If Galt comes to you and asks for his newly acquired property and you refuse, *then* crime is afoot&#x2014;you are essentially robbing him.

A custodial penalty could not be involuntarily enforced upon the breacher of this contract, the just punishment is not locking away the theif, but rather taking the stolen property (restitution) and an additional sum equal to what was initially taken (retribution). On the other hand, physical removal would be trivial to set up contractually&#x2014;either Galt is the owner of the entire covenant&#x2013;all of the roads, buildings, etc&#x2013;or a penalty clause is embedded in the contract such that any buildings that the non-green-shirt-wearer owns is immediately tranferred to Galt. Here it is a simple case of evicting an unwanted person from ones property.

> You can accept the penalty or you are no longer provided with privileges garnered by membership of a covenant - additionally in having violated the terms you have arguably sacrificed your own rights (performative contradiction to violate rights but claim for yourself.

Indeed, this would be a valid form of imprisonment, &ldquo;hey, you blue shirted cunt, if you don&rsquo;t sit on the naughty step for 5 minutes your holdings in the covenant will be forfeit and you will have no legal defence against eviction.&rdquo; However, it is wrong to say that this person has sacrificed their own rights&#x2014;it is entirely unclear what exactly it means for a man to sacrifice his rights. Lets picture our above 5-unit-gold-thief, he has not *sacrificed his right to* either the retributive or restitutive sum of gold. Such a statement would be to imply that he had some manner of right to them, which he gave up, which we shall attack piecemeal. The criminal certainly has no right to the restitutive sum&#x2014;this belongs to the victim insofar as the victim wants it back. He also has no right to the retributive sum; the instant he committed the crime he demonstrated that he thinks it is valid for the victim to do the same to him. This is not a forfeiting of rights anymore than me agreeing to give someone a hearty handshake is me forfeiting my right to not shake his hand&#x2014;in either case I demonstrate that I believe it is a valid interaction (in the former case via dialectic contradiiction, in the latter via direct consent).

Furthermore, this is more than a mere semantic squabble, in saying that rights are being ceded here, or in the later case of &ldquo;temporarily trading liberty for the retention of other rights in the future,&rdquo; you inadvertently cede the ground to our enemies that capitalism in some way limits freedom through the trading of rights away&#x2014;or even worse that the NAP is some mere &ldquo;agreement&rdquo; between individuals which can be rescinded within some domain. This loses the ground that the NAP is an objective ethic&#x2014;quite the loss indeed.


<a id="org5d1e513"></a>

# Towards a Theory of Libertarian Prisons

The above being said, the mere concept of libertarian prisons is not per se invalid. One such case where imprisonment is just is in retribution against kidnappers&#x2014;so it is perfectly valid to assert that the local sheriff who locked a man up for possession of a firearm may be locked up in turn. Furthermore, you are correct that a sufficiently set up covenant contract could indeed have terms for imprisoning someone if that person wishes to return to the covenant&#x2014;this is in essence Murphy&rsquo;s view<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> that libertarian prisons could act as being almost insurance agencies, where people voluntarily go there to demonstrate to everyone that they wish to be redeemed.


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> I can&rsquo;t remember where, perhaps in *Against Intellectual Property*.

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <https://www.youtube.com/watch?v=SzYJYSm-MfI>
